{
    "title" : "Stumptown Bear Data",
    "link"  : "http://stumptownbear.com",
    
    "work" : [{
        "id" : "webtrends-today",
        "link" : "/work/webtrends-today/",
        "title" : "Webtrends Today - iPad App",
        "content" : [
            "<p>I worked with <a href=\"http://www.mrdiggles.com/\">Benjamin Diggles</a> and <a href=\"https://twitter.com/rderstadt\">Rob Derstadt</a> to build an app that shows how users are doing in the social space.  The goal was to keep it concise; discover what is working on the user's social accounts and, if they are a Webtrends Analytics customer, see how their spaces are doing in A10.</p>",
            
            "<div class=\"item-content-left\"><h4>The Data</h4>",
            "<p>Rob handed me raw API user data from Facebook, Twitter, Youtube and Webtrends through a custom-made web app wrapper.  My job was to sift through that mess and pull out useful and interesting metrics from each social network.  After I got that data &quot;clean,&quot; I pushed it out to the app screen for consumption.</p></div>",
        	
        	"<div class=\"item-content-right\"><h4>The Play</h4>",
        	"<p>When the app loaded up the user was presented with 4 quadrants, each a different social network.  The user could then zoom in on each of them to &quot;Drill-Down&quot; for more detailed measurements.</p>",
        	"<p>While tackling the interactions in the app, the general philosophy was to provide as much options as made sense.  If the user wanted to open up one the panels, they could tap or <a href=\"http://stream.stumptownbear.com/portfolio/wt-today/zoom.jpg\">zoom</a> or swipe. If the interaction made sense, I included it.</p></div>",
        	
        	"<h5>Technologies Utilized</h5>"
        ],
        
        "technologies" : [
    	   "HTML5 / CSS3",
    	   "Javascript",
    	   "Social APIs",
    	   "iOS and Touch"
        ],
        
        "media" : [ 
            { "url": "http://stream.stumptownbear.com/portfolio/wt-today/overview.jpg",  "index": "one"   },
            { "url": "http://stream.stumptownbear.com/portfolio/wt-today/webtrends.jpg", "index": "two"   },
            { "url": "http://stream.stumptownbear.com/portfolio/wt-today/facebook.jpg",  "index": "three" },
            { "url": "http://stream.stumptownbear.com/portfolio/wt-today/twitter.jpg",   "index": "four"  },
            { "url": "http://stream.stumptownbear.com/portfolio/wt-today/youtube.jpg",   "index": "five"  },
            { "url": "http://stream.stumptownbear.com/portfolio/wt-today/a10.jpg",       "index": "six"   }
        ]
    }],
    
    "partners" : [{ 
        "name"  : "Web trends",     
        "genre" : "Analytics", 
        "raw"   : "analytics" 
    },{ 
        "name"  : "Link Tech",     
        "genre" : "SEO",
        "raw"   : "seo" 
    },{ 
        "name"  : "South Ridge High School",     
        "genre" : "Education",
        "raw"   : "education" 
    },{ 
        "name"  : "Natalie Renee Music", 
        "genre" : "Music",
        "raw"   : "music" 
    }, { 
        "name"  : "Blue Shoe Project",          
        "genre" : "Education",
        "raw"   : "education" 
    }, { 
        "name"  : "Minutes App",
        "genre" : "Time Management" ,
        "raw"   : "time-management" 
    }, { 
        "name"  : "IOUNOI",
        "genre" : "Music",
        "raw"   : "music" 
    }, { 
        "name"  : "Precision Machines",
        "genre" : "Music",
        "raw"   : "music" 
    }],
    
    "timeline" : [{
        "year"  : "2003",
        "story" : "I played Warcraft 3 custom games every morning before school in the 7th and 8th grades. In the evenings I learned how to program JASS to make my own maps."
    }, {
        "year"  : "2004",
        "story" : "I took my first offical programming class at Southridge High School.  I learned VB.NET from an incredible teacher, who would end up hiring me to redesign and develop the school's website."
    }, {
        "year"  : "2005",
        "story" : "I built my first website fontend after seeing a presentation on pseudo-selectors and there uses in interaction.  This was my first time delving into interactivity."
    }, {
        "year"  : "2006",
        "story" : "I started studying C++ on my own using my teacher as resource of unlimited knowledge."
    }, {
        "year"  : "2007",
        "story" : "Designed and programmed my first blog from scratch.  It was pastel and dark gray, it used lots of grunge and noise; looking back, it was not very good looking, but it worked well."
    }, {
        "year"  : "2008",
        "story" : "I barely graduated from High School.  I was spending of my time engrossed in my computer; I was learning to push the boundaries of interaction with JavaScript and use my love for Minimalism and Art Deco geometry in design."
    }, {
        "year"  : "2009",
        "story" : "I studied Jazz composition by a Saxophonist that had clearly snorted a stream of cocaine in his younger days and had followed it with years of cigarettes and martinis."
    }, {
        "year"  : "2011",
        "story" : "After wandering through life for a year, making art and music, I returned to creating impeccable code and functional, beautiful design.  I started to study the psychology of shapes, colors and words on how people interact with interfaces."
    }, {
        "year"  : "2012",
        "story" : "I sent out seven applications to web companies around Portland, Oregon. After a strange, strange interview at Webtrends that included a bottle of mirror pond, I started as the Interactive Designer in their newly forming Digital Intelligence Lab."
    }]
}